# Core tools
brew "stow"
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "jq"
brew "gh"
brew "glab"

# Shell
brew "zsh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# Development
brew "goenv"
brew "mongosh"

# Utilities
brew "bash"
brew "bc"
brew "coreutils"
brew "gawk"
brew "gsed"
brew "nowplaying-cli"
brew "btop"
brew "zk"

# Casks (GUI applications)
cask "kitty"
cask "phoenix"

# Fonts
cask "font-monaspice-nerd-font"
cask "font-noto-sans-symbols-2"
